#+TITLE: Bootstrap Optimizer Walkthrough
#+AUTHOR: Drew
#+OPTIONS: toc:2 num:nil html-style:nil
#+PROPERTY: header-args:jupyter-python :session risk-env :kernel python3 :results graphics file :dir (projectile-project-root) :mkdirp yes

** Estimate Covariance and Expected Returns for Path:0

The optimizer estimates expected returns mu and covariance cov from the selected path. These estimates can be noisy, so the current implementation applies shrinkage and a small
numerical stabilization.

For expected returns, the raw estimate is the per-asset mean return from the current path. Mean shrinkage blends that estimate with a simpler target:
mu_shrunk = (1 - alpha) * raw_mu + alpha * target_mu
If the target is zero, all assets are pulled toward zero expected return. If the target is grand_mean, all assets are pulled toward the same common average return across assets in the
current estimate. This reduces sensitivity to noisy cross-sectional differences.

For covariance, the raw estimate is either the historical covariance, EWMA covariance, or factor-model covariance. Covariance shrinkage blends that raw matrix with a structured target:
cov_shrunk = (1 - alpha) * raw_cov + alpha * target_cov
A diagonal target keeps each asset’s variance but removes correlations. An identity target goes further by replacing the covariance matrix with one that has the same average variance on
the diagonal and zero correlations.

After shrinkage, the covariance matrix is stabilized numerically by forcing symmetry and adding a very small ridge term to the diagonal. Shrinkage is a statistical regularization step,
while stabilization is a numerical one. The goal is to make the optimizer less sensitive to estimation noise and less likely to fail on poorly conditioned covariance matrices.

#+begin_src jupyter-python :exports both :results output raw

cov_factor = compute_cov(
    path_0_sample_fwrd_ds,
    factor_returns=factor_path_da,
    method="factor_model",
    shrinkage=0.0,
    shrinkage_target="diagonal",
)

mu_factor = compute_mu(
    path_0_sample_fwrd_ds,
    factor_returns=factor_path_da,
    method="factor_model",
    shrinkage=0.0,
    shrinkage_target="zero",
)

cov_hist = compute_cov(
    asset_path_da,
    factor_returns=factor_path_da,
    method="hist",
    shrinkage=0.0,
    shrinkage_target="diagonal",
)

# Print a table of mu computed from the factor model
mu_factor = mu_factor.reset_index()
print(tabulate(mu_factor, headers=['asset', 'log(r)'], tablefmt='orgtbl', showindex=False))
#+end_src

#+RESULTS:
#+begin_example
| asset   |      log(r) |
|---------+-------------|
| AAPL    | 0.00159766  |
| AMT     | 0.000375852 |
| CAT     | 0.00105443  |
| JNJ     | 0.000376508 |
| JPM     | 0.00107845  |
| KO      | 0.000675224 |
| META    | 0.00123428  |
| MSFT    | 0.00104196  |
| NVDA    | 0.00263864  |
| PG      | 0.000522776 |
| XOM     | 0.000594862 |
#+end_example


** Calculate the Sample Min-Variance Optimized Weights for Path:0

The covariance estimation method for this optimization is 'factor_model' which
can be compared with the direct asset-to-asset covariance estimation ('hist').

#+begin_src jupyter-python :exports both :results output raw
factor_wts = optimize(
    cov=cov_factor,
    objective="min_variance",
    long_only=True,
    budget=1.0,
)

factor_wts = factor_wts.reset_index()
print(tabulate(factor_wts, headers=factor_wts.columns, tablefmt='orgtbl', showindex=False))
#+end_src

#+RESULTS:
#+begin_example
| asset   |     weights |
|---------+-------------|
| AAPL    | 0.0015974   |
| AMT     | 0.0628397   |
| CAT     | 0.00227498  |
| JNJ     | 0.260994    |
| JPM     | 0.0480395   |
| KO      | 0.184652    |
| META    | 0.0331563   |
| MSFT    | 0.0802028   |
| NVDA    | 3.77438e-18 |
| PG      | 0.240582    |
| XOM     | 0.0856616   |
#+end_example

#+begin_src jupyter-python :exports both :results output raw
hist_wts = optimize(
    cov=cov_hist,
    objective="min_variance",
    long_only=True,
    budget=1.0,
)

hist_wts = hist_wts.reset_index()
print(tabulate(hist_wts, headers=hist_wts.columns, tablefmt='orgtbl', showindex=False))
#+end_src

#+RESULTS:
#+begin_example
| asset   |     weights |
|---------+-------------|
| AAPL    | 2.71051e-20 |
| AMT     | 0.051285    |
| CAT     | 0.0114161   |
| JNJ     | 0.255669    |
| JPM     | 0.0547053   |
| KO      | 0.187705    |
| META    | 0.0335511   |
| MSFT    | 0.0575316   |
| NVDA    | 0.00639553  |
| PG      | 0.265896    |
| XOM     | 0.0758445   |
#+end_example


** The optimizer ran and outputed some weights, but should we trust the outputs?

The initial guess for the weights is an equal-weighted portfolio. Compare to
closed-form solutions.

#+begin_src jupyter-python :exports both :results output raw
  avg_var_hist = np.trace(cov_hist.values) / cov_hist.shape[0]
  avg_var_factor = np.trace(cov_factor.values) / cov_factor.shape[0]

  hist_identity_like = np.eye(cov_hist.shape[0]) * avg_var_hist
  factor_identity_like = np.eye(cov_factor.shape[0]) * avg_var_factor

  print("Hist cov close to scaled identity:",
        np.allclose(cov_hist.values, hist_identity_like, atol=1e-6))
  print("Factor cov close to scaled identity:",
        np.allclose(cov_factor.values, factor_identity_like, atol=1e-6))
  print()

  ones_hist = np.ones(len(cov_hist))
  closed_form_hist = np.linalg.solve(cov_hist.values, ones_hist)
  closed_form_hist = closed_form_hist / closed_form_hist.sum()
  closed_form_hist = pd.Series(closed_form_hist, index=cov_hist.index, name="closed_form_hist")

  ones_factor = np.ones(len(cov_factor))
  closed_form_factor = np.linalg.solve(cov_factor.values, ones_factor)
  closed_form_factor = closed_form_factor / closed_form_factor.sum()
  closed_form_factor = pd.Series(closed_form_factor, index=cov_factor.index, name="closed_form_factor")

  print("Closed-form unconstrained min-var weights from hist cov")
  print(closed_form_hist.round(4))
  print()

  print("Closed-form unconstrained min-var weights from factor cov")
  print(closed_form_factor.round(4))
  print()

  print("Hist covariance diagonal")
  print(pd.Series(np.diag(cov_hist.values), index=cov_hist.index).round(6))
  print()

  print("Factor covariance diagonal")
  print(pd.Series(np.diag(cov_factor.values), index=cov_factor.index).round(6))
#+end_src

#+RESULTS:
#+begin_example
Hist cov close to scaled identity: False
Factor cov close to scaled identity: False

Closed-form unconstrained min-var weights from hist cov
asset
AAPL    0.0001
AMT     0.0513
CAT     0.0113
JNJ     0.2557
JPM     0.0549
KO      0.1872
META    0.0336
MSFT    0.0571
NVDA    0.0065
PG      0.2664
XOM     0.0759
Name: closed_form_hist, dtype: float64

Closed-form unconstrained min-var weights from factor cov
asset
AAPL    0.0051
AMT     0.0625
CAT     0.0036
JNJ     0.2603
JPM     0.0478
KO      0.1823
META    0.0343
MSFT    0.0854
NVDA   -0.0071
PG      0.2403
XOM     0.0855
Name: closed_form_factor, dtype: float64

Hist covariance diagonal
asset
AAPL    0.000303
AMT     0.000228
CAT     0.000332
JNJ     0.000112
JPM     0.000254
KO      0.000103
META    0.000595
MSFT    0.000238
NVDA    0.000872
PG      0.000111
XOM     0.000272
dtype: float64

Factor covariance diagonal
asset
AAPL    0.000303
AMT     0.000228
CAT     0.000332
JNJ     0.000112
JPM     0.000254
KO      0.000103
META    0.000595
MSFT    0.000238
NVDA    0.000872
PG      0.000111
XOM     0.000272
dtype: float64
#+end_example

